; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	thermograph2 - mode
	image1 - mode
	thermograph0 - mode
	GroundStation3 - direction
	Star6 - direction
	Star7 - direction
	GroundStation8 - direction
	GroundStation11 - direction
	GroundStation13 - direction
	Star9 - direction
	GroundStation0 - direction
	GroundStation12 - direction
	Star2 - direction
	GroundStation14 - direction
	Star5 - direction
	GroundStation4 - direction
	Star10 - direction
	GroundStation1 - direction
	Planet15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation12)
	(calibration_target instrument0 GroundStation14)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 GroundStation13)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star18)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 GroundStation14)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 GroundStation14)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
	(supports instrument3 image1)
	(supports instrument3 thermograph2)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 Star10)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
)
(:goal (and
	(pointing satellite2 GroundStation12)
	(have_image Planet15 thermograph2)
	(have_image Planet16 image1)
	(have_image Phenomenon17 thermograph2)
	(have_image Star18 thermograph0)
))

)

; plan
1. (turn_to satellite3 groundstation1 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 groundstation1)
   goals met: 0 of 5
2. (switch_on instrument3 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument3)
   goals met: 0 of 5
3. (calibrate satellite3 instrument3 groundstation1)
   added: (calibrated instrument3)
   goals met: 0 of 5
4. (turn_to satellite3 planet15 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 planet15)
   goals met: 0 of 5
5. (take_image satellite3 planet15 instrument3 thermograph2)
   added: (have_image planet15 thermograph2)
   goals met: 1 of 5
6. (turn_to satellite3 phenomenon17 planet15)
   deleted: (pointing satellite3 planet15)
   added: (pointing satellite3 phenomenon17)
   goals met: 1 of 5
7. (take_image satellite3 phenomenon17 instrument3 thermograph2)
   added: (have_image phenomenon17 thermograph2)
   goals met: 2 of 5
8. (turn_to satellite2 groundstation12 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 groundstation12)
   goals met: 3 of 5
9. (turn_to satellite3 planet16 phenomenon17)
   deleted: (pointing satellite3 phenomenon17)
   added: (pointing satellite3 planet16)
   goals met: 3 of 5
10. (take_image satellite3 planet16 instrument3 image1)
   added: (have_image planet16 image1)
   goals met: 4 of 5
11. (turn_to satellite3 star18 planet16)
   deleted: (pointing satellite3 planet16)
   added: (pointing satellite3 star18)
   goals met: 4 of 5
12. (take_image satellite3 star18 instrument3 thermograph0)
   added: (have_image star18 thermograph0)
   goals met: 5 of 5
